app/Restorant.php

select * from `plan` where `plan`.`id` = 3 limit 1
select * from `users` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1
select count(*) as aggregate from `items` where `category_id` in (2, 1, 3, 4, 69) and `deleted_at` is null and `items`.`deleted_at` is null
---
    public function getPlanAttribute(){
        $planInfo=[
            'plan'=>null,
            "canMakeNewOrder"=>true,
            "canAddNewItems"=>false,
            "itemsMessage"=>"",
            "itemsAlertType"=>"success",
            "ordersMessage"=>"",
            "ordersAlertType"=>"success"
        ];

        //Find the plan
        $currentPlan = Plans::withTrashed()->find($this->user->mplanid());
        if($currentPlan==null){
            //Make artificial plan - usefull when migrating the system  - or wrong free plan id
            $currentPlan=new Plans();
            $currentPlan->name =__('No plan found');
            $currentPlan->price = 0;
            $currentPlan->limit_items = 0;
            $currentPlan->enable_ordering = 1;
            $currentPlan->limit_orders = 0;
            $currentPlan->period=1;
        }
        $planInfo['plan']=$currentPlan->toArray();


        //Count items
        $itemsCount = Items::whereIn('category_id', $this->categories->pluck('id')->toArray())->whereNull('deleted_at')->count();

select * from `items` where `category_id` in (2, 1, 3, 4, 69) and `featured` = 1 and `items`.`deleted_at` is null
---
    public function featured_items()
    {
        $ids = $this->categories()->pluck('id');
      return  $items = Items::whereIn('category_id', $ids)->where('featured',1)->get();

select * from `hours` where `hours`.`restorant_id` = 1 and `hours`.`restorant_id` is not null
---
    public function getBusinessHours(){

        $creationArray=[
            'monday'     => [],
            'tuesday'    => [],
            'wednesday'  => [],
            'thursday'   => [],
            'friday'     => [],
            'saturday'   => [],
            'sunday'     => [],
            'overflow' => true
        ];

        $dayKeys=array_keys($creationArray);

        //Get all working hours
        $workingHours=$this->hours()->get()->toArray();