app/Http/Controllers/FrontEndController.php

            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();
---
select * from `tables` where `restaurant_id` = 1